Repository: Odyssey/cinnamon-spices-applets
Catalog: quick-screenshot-sharing@Odyssey/files/quick-screenshot-sharing@Odyssey/po/*.po
Languages: ca

source: Make a screenshot, save it and upload it. Screenshots are saved in ~/Pictures/Screenshots/year-month When uploaded, the link gets copied to your clipboard. A log of your screenshots is kept at ~/quick-screenshot-sharing.history
ca: Feu un captura de pantalla, guardeu-la i pugeu-la. Les captures es guarden a ~/Imatges/Screenshots/any-mes En ser pujades, l'enllaç és copiat al vostre porta-papers. S'escriu un registre de les captures a ~/quick-screenshot-sharing.history

source: is missing required package(s). Please ensure the following packages are installed by using your distribution's 'package manager: xdg-user-dirs gnome-screenshot curl xclip jq
ca: no troba algun(s) paquet(s) necessari(s). Si us plau, assegureu-vos que els paquets següents estiguin instal·lats mitjançant el vostre gestor de paquets: xgd-user-dirs gnome-screenshot curl xclip jq

source: Error while checking for required applet packages. The package 'which' is widely available and used for this check. Are you perhaps missing it? If the problem persists, consider opening an issue at https://github.com/linuxmint/cinnamon-spices-applets/issues and tagging @Odyssey
ca: Hi ha hagut un error comprovant els requeriments de la miniaplicació. El paquet 'which' s'utilitza per a aquesta comprovació. Pot ser que no estigui instal·lat? Si el problema persisteix, considereu obrir una incidència a https://github.com/linuxmint/cinnamon-spices-applets/issues i mencionar a @Odyssey

source: The remote hosting service is not responding, so the screenshot will not be uploaded. Check Melange logs for more details.
ca: El servidor d'allotjament remot no està responent, de manera que la captura no es pujarà. Reviseu el registre de Melange per més detalls.

source: The remote hosting server did not return code 200. If you do not have internet issues and the problem persists over time, you may consider opening an issue at https://github.com/linuxmint/cinnamon-spices-applets/issues and tagging @Odyssey
ca: El servidor remot d'allotjament no ha retornat codi 200. Si no teniu problemes d'Internet i el problema persisteix durant el temps, podeu considerar obrir una incidència a ttps://github.com/linuxmint/cinnamon-spices-applets/issues i mencionar a @Odyssey

source: You are missing some of the required packages for this applet to work. Please open a terminal and follow the instructions:
ca: Falta instal·lar alguns paquets necessaris pel funcionament de la miniaplicació. Si us plau, obriu un terminal i seguiu les instruccions:

source: For Debian/Ubuntu based systems, run: sudo apt install xdg-user-dirs gnome-screenshot curl jq xclip
ca: Per a sistemes basats en Debian o Ubuntu, executeu: sudo apt install xdg-user-dirs gnome-screenshot curl jq xclip

source: For Fedora based systems, run: sudo dnf install xdg-user-dirs gnome-screenshot curl jq xclip
ca: Per a sistemes basats en Fedora, executeu: sudo dnf install xdg-user-dirs gnome-screenshot curl jq xclip

source: For Arch based systems, run: sudo pacman -S xdg-user-dirs gnome-screenshot curl jq xclip
ca: Per a sistemes basats en Arch, executeu: sudo pacman -S xdg-user-dirs gnome-screenshot curl jq xclip

source: Install the following packages, using your distribution's package manager: xdg-user-dirs gnome-screenshot curl jq xclip
ca: Instal·leu els següents paquets, utilitzant el gestor de paquets de la vostra distribució: xdg-user-dirs gnome-screenshot curl jq xclip

source: Quick screenshot sharing
ca: Compartició ràpida de captures de pantalla

source: Make a screenshot, upload it and share the link from your clipboard. The packages 'xdg-user-dirs', 'gnome-screenshot', 'curl', 'jq' and 'xclip' must be installed.
ca: Feu una captura de pantalla, pugeu-la i compartiu l'enllaç des del vostre porta-papers. Els paquets 'xdg-user-dirs', 'gnome-screenshot', 'curl', 'jq' i 'xclip' han d'estar instal·lats.
